zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_PLL.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_PLL.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_PLL
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_PLL_H_)  /* Check if memory map has not been already included */
#define S32K566_PLL_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- PLL Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PLL_Peripheral_Access_Layer PLL Peripheral Access Layer
 * @{
 */

/** PLL - Register Layout Typedef */
typedef struct PLL_Struct {
  struct PLL_CTRL {                                /* offset: 0x0 */
    __IO uint32_t RW;                                /**< PLL Control, offset: 0x0 */
    __IO uint32_t SET;                               /**< PLL Control, offset: 0x4 */
    __IO uint32_t CLR;                               /**< PLL Control, offset: 0x8 */
    __IO uint32_t TOG;                               /**< PLL Control, offset: 0xC */
  } CTRL;
  uint8_t RESERVED_0[48];
  struct PLL_SPREAD_SPECTRUM {                     /* offset: 0x40 */
    __IO uint32_t RW;                                /**< PLL Spread Spectrum, offset: 0x40 */
    __IO uint32_t SET;                               /**< PLL Spread Spectrum, offset: 0x44 */
    __IO uint32_t CLR;                               /**< PLL Spread Spectrum, offset: 0x48 */
    __IO uint32_t TOG;                               /**< PLL Spread Spectrum, offset: 0x4C */
  } SPREAD_SPECTRUM;
  struct PLL_NUMERATOR {                           /* offset: 0x50 */
    __IO uint32_t RW;                                /**< PLL Numerator, offset: 0x50 */
    __IO uint32_t SET;                               /**< PLL Numerator, offset: 0x54 */
    __IO uint32_t CLR;                               /**< PLL Numerator, offset: 0x58 */
    __IO uint32_t TOG;                               /**< PLL Numerator, offset: 0x5C */
  } NUMERATOR;
  struct PLL_DENOMINATOR {                         /* offset: 0x60 */
    __IO uint32_t RW;                                /**< PLL Denominator, offset: 0x60 */
    __IO uint32_t SET;                               /**< PLL Denominator, offset: 0x64 */
    __IO uint32_t CLR;                               /**< PLL Denominator, offset: 0x68 */
    __IO uint32_t TOG;                               /**< PLL Denominator, offset: 0x6C */
  } DENOMINATOR;
  struct PLL_DIV {                                 /* offset: 0x70 */
    __IO uint32_t RW;                                /**< PLL Dividers, offset: 0x70 */
    __IO uint32_t SET;                               /**< PLL Dividers, offset: 0x74 */
    __IO uint32_t CLR;                               /**< PLL Dividers, offset: 0x78 */
    __IO uint32_t TOG;                               /**< PLL Dividers, offset: 0x7C */
  } DIV;
  struct PLL_DFS_CTRL_0 {                          /* offset: 0x80 */
    __IO uint32_t RW;                                /**< DFS Control, offset: 0x80, available only on: PLL_0 (missing on CPE_PLL, PLL_1) */
    __IO uint32_t SET;                               /**< DFS Control, offset: 0x84, available only on: PLL_0 (missing on CPE_PLL, PLL_1) */
    __IO uint32_t CLR;                               /**< DFS Control, offset: 0x88, available only on: PLL_0 (missing on CPE_PLL, PLL_1) */
    __IO uint32_t TOG;                               /**< DFS Control, offset: 0x8C, available only on: PLL_0 (missing on CPE_PLL, PLL_1) */
  } DFS_CTRL_0;
  struct PLL_DFS_DIV_0 {                           /* offset: 0x90 */
    __IO uint32_t RW;                                /**< DFS Division, offset: 0x90, available only on: PLL_0 (missing on CPE_PLL, PLL_1) */
    __IO uint32_t SET;                               /**< DFS Division, offset: 0x94, available only on: PLL_0 (missing on CPE_PLL, PLL_1) */
    __IO uint32_t CLR;                               /**< DFS Division, offset: 0x98, available only on: PLL_0 (missing on CPE_PLL, PLL_1) */
    __IO uint32_t TOG;                               /**< DFS Division, offset: 0x9C, available only on: PLL_0 (missing on CPE_PLL, PLL_1) */
  } DFS_DIV_0;
  struct PLL_DFS_CTRL_1 {                          /* offset: 0xA0 */
    __IO uint32_t RW;                                /**< DFS Control, offset: 0xA0, available only on: PLL_0 (missing on CPE_PLL, PLL_1) */
    __IO uint32_t SET;                               /**< DFS Control, offset: 0xA4, available only on: PLL_0 (missing on CPE_PLL, PLL_1) */
    __IO uint32_t CLR;                               /**< DFS Control, offset: 0xA8, available only on: PLL_0 (missing on CPE_PLL, PLL_1) */
    __IO uint32_t TOG;                               /**< DFS Control, offset: 0xAC, available only on: PLL_0 (missing on CPE_PLL, PLL_1) */
  } DFS_CTRL_1;
  struct PLL_DFS_DIV_1 {                           /* offset: 0xB0 */
    __IO uint32_t RW;                                /**< DFS Division, offset: 0xB0, available only on: PLL_0 (missing on CPE_PLL, PLL_1) */
    __IO uint32_t SET;                               /**< DFS Division, offset: 0xB4, available only on: PLL_0 (missing on CPE_PLL, PLL_1) */
    __IO uint32_t CLR;                               /**< DFS Division, offset: 0xB8, available only on: PLL_0 (missing on CPE_PLL, PLL_1) */
    __IO uint32_t TOG;                               /**< DFS Division, offset: 0xBC, available only on: PLL_0 (missing on CPE_PLL, PLL_1) */
  } DFS_DIV_1;
  struct PLL_DFS_CTRL_2 {                          /* offset: 0xC0 */
    __IO uint32_t RW;                                /**< DFS Control, offset: 0xC0, available only on: PLL_0 (missing on CPE_PLL, PLL_1) */
    __IO uint32_t SET;                               /**< DFS Control, offset: 0xC4, available only on: PLL_0 (missing on CPE_PLL, PLL_1) */
    __IO uint32_t CLR;                               /**< DFS Control, offset: 0xC8, available only on: PLL_0 (missing on CPE_PLL, PLL_1) */
    __IO uint32_t TOG;                               /**< DFS Control, offset: 0xCC, available only on: PLL_0 (missing on CPE_PLL, PLL_1) */
  } DFS_CTRL_2;
  struct PLL_DFS_DIV_2 {                           /* offset: 0xD0 */
    __IO uint32_t RW;                                /**< DFS Division, offset: 0xD0, available only on: PLL_0 (missing on CPE_PLL, PLL_1) */
    __IO uint32_t SET;                               /**< DFS Division, offset: 0xD4, available only on: PLL_0 (missing on CPE_PLL, PLL_1) */
    __IO uint32_t CLR;                               /**< DFS Division, offset: 0xD8, available only on: PLL_0 (missing on CPE_PLL, PLL_1) */
    __IO uint32_t TOG;                               /**< DFS Division, offset: 0xDC, available only on: PLL_0 (missing on CPE_PLL, PLL_1) */
  } DFS_DIV_2;
  struct PLL_DFS_CTRL_3 {                          /* offset: 0xE0 */
    __IO uint32_t RW;                                /**< DFS Control, offset: 0xE0, available only on: PLL_0 (missing on CPE_PLL, PLL_1) */
    __IO uint32_t SET;                               /**< DFS Control, offset: 0xE4, available only on: PLL_0 (missing on CPE_PLL, PLL_1) */
    __IO uint32_t CLR;                               /**< DFS Control, offset: 0xE8, available only on: PLL_0 (missing on CPE_PLL, PLL_1) */
    __IO uint32_t TOG;                               /**< DFS Control, offset: 0xEC, available only on: PLL_0 (missing on CPE_PLL, PLL_1) */
  } DFS_CTRL_3;
  struct PLL_DFS_DIV_3 {                           /* offset: 0xF0 */
    __IO uint32_t RW;                                /**< DFS Division, offset: 0xF0, available only on: PLL_0 (missing on CPE_PLL, PLL_1) */
    __IO uint32_t SET;                               /**< DFS Division, offset: 0xF4, available only on: PLL_0 (missing on CPE_PLL, PLL_1) */
    __IO uint32_t CLR;                               /**< DFS Division, offset: 0xF8, available only on: PLL_0 (missing on CPE_PLL, PLL_1) */
    __IO uint32_t TOG;                               /**< DFS Division, offset: 0xFC, available only on: PLL_0 (missing on CPE_PLL, PLL_1) */
  } DFS_DIV_3;
  uint8_t RESERVED_1[128];
  __IO uint32_t PLL_OUTPUT_DIVIDER_0;              /**< PLL Output Divider, offset: 0x180 */
  uint8_t RESERVED_2[140];
  struct PLL_PLL_CLK_ODIV {                        /* offset: 0x210 */
    __IO uint32_t RW;                                /**< PLL Clock Output Divider, offset: 0x210 */
    __IO uint32_t SET;                               /**< PLL Clock Output Divider, offset: 0x214 */
    __IO uint32_t CLR;                               /**< PLL Clock Output Divider, offset: 0x218 */
    __IO uint32_t TOG;                               /**< PLL Clock Output Divider, offset: 0x21C */
  } PLL_CLK_ODIV;
  __IO uint32_t PLL_STATUS;                        /**< PLL Status, offset: 0x220 */
  __I  uint32_t DFS_STATUS;                        /**< DFS Status, offset: 0x224, available only on: PLL_0 (missing on CPE_PLL, PLL_1) */
} PLL_Type, *PLL_MemMapPtr;

/** Number of instances of the PLL module. */
#define PLL_INSTANCE_COUNT                       (3u)

