zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_PLL.h
/* PLL - Peripheral instance base addresses */
/** Peripheral CPE_PLL base address */
#define IP_CPE_PLL_BASE                          (0x41078000u)
/** Peripheral CPE_PLL base pointer */
#define IP_CPE_PLL                               ((PLL_Type *)IP_CPE_PLL_BASE)
/** Peripheral PLL_0 base address */
#define IP_PLL_0_BASE                            (0x404BC000u)
/** Peripheral PLL_0 base pointer */
#define IP_PLL_0                                 ((PLL_Type *)IP_PLL_0_BASE)
/** Peripheral PLL_1 base address */
#define IP_PLL_1_BASE                            (0x40B40000u)
/** Peripheral PLL_1 base pointer */
#define IP_PLL_1                                 ((PLL_Type *)IP_PLL_1_BASE)
/** Array initializer of PLL peripheral base addresses */
#define IP_PLL_BASE_ADDRS                        { IP_CPE_PLL_BASE, IP_PLL_0_BASE, IP_PLL_1_BASE }
/** Array initializer of PLL peripheral base pointers */
#define IP_PLL_BASE_PTRS                         { IP_CPE_PLL, IP_PLL_0, IP_PLL_1 }

/* ----------------------------------------------------------------------------
   -- PLL Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PLL_Register_Masks PLL Register Masks
 * @{
 */

/*! @name CTRL - PLL Control */
/*! @{ */

#define PLL_CTRL_POWERUP_MASK                    (0x1U)
#define PLL_CTRL_POWERUP_SHIFT                   (0U)
#define PLL_CTRL_POWERUP_WIDTH                   (1U)
#define PLL_CTRL_POWERUP(x)                      (((uint32_t)(((uint32_t)(x)) << PLL_CTRL_POWERUP_SHIFT)) & PLL_CTRL_POWERUP_MASK)

#define PLL_CTRL_CLKMUX_EN_MASK                  (0x2U)
#define PLL_CTRL_CLKMUX_EN_SHIFT                 (1U)
#define PLL_CTRL_CLKMUX_EN_WIDTH                 (1U)
#define PLL_CTRL_CLKMUX_EN(x)                    (((uint32_t)(((uint32_t)(x)) << PLL_CTRL_CLKMUX_EN_SHIFT)) & PLL_CTRL_CLKMUX_EN_MASK)

#define PLL_CTRL_REFCLKOUT_EN_MASK               (0x8U)
#define PLL_CTRL_REFCLKOUT_EN_SHIFT              (3U)
#define PLL_CTRL_REFCLKOUT_EN_WIDTH              (1U)
#define PLL_CTRL_REFCLKOUT_EN(x)                 (((uint32_t)(((uint32_t)(x)) << PLL_CTRL_REFCLKOUT_EN_SHIFT)) & PLL_CTRL_REFCLKOUT_EN_MASK)

#define PLL_CTRL_SPREADCTL_MASK                  (0x100U)
#define PLL_CTRL_SPREADCTL_SHIFT                 (8U)
#define PLL_CTRL_SPREADCTL_WIDTH                 (1U)
#define PLL_CTRL_SPREADCTL(x)                    (((uint32_t)(((uint32_t)(x)) << PLL_CTRL_SPREADCTL_SHIFT)) & PLL_CTRL_SPREADCTL_MASK)

#define PLL_CTRL_MULTIPHASE_SDM_DISABLE_MASK     (0x1000U)
#define PLL_CTRL_MULTIPHASE_SDM_DISABLE_SHIFT    (12U)
#define PLL_CTRL_MULTIPHASE_SDM_DISABLE_WIDTH    (1U)
#define PLL_CTRL_MULTIPHASE_SDM_DISABLE(x)       (((uint32_t)(((uint32_t)(x)) << PLL_CTRL_MULTIPHASE_SDM_DISABLE_SHIFT)) & PLL_CTRL_MULTIPHASE_SDM_DISABLE_MASK)

#define PLL_CTRL_REF_CLK_SEL_MASK                (0x10000U)
#define PLL_CTRL_REF_CLK_SEL_SHIFT               (16U)
#define PLL_CTRL_REF_CLK_SEL_WIDTH               (1U)
#define PLL_CTRL_REF_CLK_SEL(x)                  (((uint32_t)(((uint32_t)(x)) << PLL_CTRL_REF_CLK_SEL_SHIFT)) & PLL_CTRL_REF_CLK_SEL_MASK)
/*! @} */

/*! @name SPREAD_SPECTRUM - PLL Spread Spectrum */
/*! @{ */

#define PLL_SPREAD_SPECTRUM_STEP_MASK            (0x7FFFU)
#define PLL_SPREAD_SPECTRUM_STEP_SHIFT           (0U)
#define PLL_SPREAD_SPECTRUM_STEP_WIDTH           (15U)
#define PLL_SPREAD_SPECTRUM_STEP(x)              (((uint32_t)(((uint32_t)(x)) << PLL_SPREAD_SPECTRUM_STEP_SHIFT)) & PLL_SPREAD_SPECTRUM_STEP_MASK)

#define PLL_SPREAD_SPECTRUM_ENABLE_MASK          (0x8000U)
#define PLL_SPREAD_SPECTRUM_ENABLE_SHIFT         (15U)
#define PLL_SPREAD_SPECTRUM_ENABLE_WIDTH         (1U)
#define PLL_SPREAD_SPECTRUM_ENABLE(x)            (((uint32_t)(((uint32_t)(x)) << PLL_SPREAD_SPECTRUM_ENABLE_SHIFT)) & PLL_SPREAD_SPECTRUM_ENABLE_MASK)

#define PLL_SPREAD_SPECTRUM_STOP_MASK            (0xFFFF0000U)
#define PLL_SPREAD_SPECTRUM_STOP_SHIFT           (16U)
#define PLL_SPREAD_SPECTRUM_STOP_WIDTH           (16U)
#define PLL_SPREAD_SPECTRUM_STOP(x)              (((uint32_t)(((uint32_t)(x)) << PLL_SPREAD_SPECTRUM_STOP_SHIFT)) & PLL_SPREAD_SPECTRUM_STOP_MASK)
/*! @} */

/*! @name NUMERATOR - PLL Numerator */
/*! @{ */

#define PLL_NUMERATOR_MFN_MASK                   (0xFFFFFFFCU)
#define PLL_NUMERATOR_MFN_SHIFT                  (2U)
#define PLL_NUMERATOR_MFN_WIDTH                  (30U)
#define PLL_NUMERATOR_MFN(x)                     (((uint32_t)(((uint32_t)(x)) << PLL_NUMERATOR_MFN_SHIFT)) & PLL_NUMERATOR_MFN_MASK)
/*! @} */

/*! @name DENOMINATOR - PLL Denominator */
/*! @{ */

#define PLL_DENOMINATOR_MFD_MASK                 (0x3FFFFFFFU)
#define PLL_DENOMINATOR_MFD_SHIFT                (0U)
#define PLL_DENOMINATOR_MFD_WIDTH                (30U)
#define PLL_DENOMINATOR_MFD(x)                   (((uint32_t)(((uint32_t)(x)) << PLL_DENOMINATOR_MFD_SHIFT)) & PLL_DENOMINATOR_MFD_MASK)
/*! @} */

/*! @name DIV - PLL Dividers */
/*! @{ */

#define PLL_DIV_RDIV_MASK                        (0xE000U)
#define PLL_DIV_RDIV_SHIFT                       (13U)
#define PLL_DIV_RDIV_WIDTH                       (3U)
#define PLL_DIV_RDIV(x)                          (((uint32_t)(((uint32_t)(x)) << PLL_DIV_RDIV_SHIFT)) & PLL_DIV_RDIV_MASK)

#define PLL_DIV_MFI_MASK                         (0x1FF0000U)
#define PLL_DIV_MFI_SHIFT                        (16U)
#define PLL_DIV_MFI_WIDTH                        (9U)
#define PLL_DIV_MFI(x)                           (((uint32_t)(((uint32_t)(x)) << PLL_DIV_MFI_SHIFT)) & PLL_DIV_MFI_MASK)
/*! @} */

/*! @name DFS_CTRL_0 - DFS Control */
/*! @{ */

#define PLL_DFS_CTRL_0_BYPASS_EN_MASK            (0x800000U)
#define PLL_DFS_CTRL_0_BYPASS_EN_SHIFT           (23U)
#define PLL_DFS_CTRL_0_BYPASS_EN_WIDTH           (1U)
#define PLL_DFS_CTRL_0_BYPASS_EN(x)              (((uint32_t)(((uint32_t)(x)) << PLL_DFS_CTRL_0_BYPASS_EN_SHIFT)) & PLL_DFS_CTRL_0_BYPASS_EN_MASK)

#define PLL_DFS_CTRL_0_CLKOUT_EN_MASK            (0x40000000U)
#define PLL_DFS_CTRL_0_CLKOUT_EN_SHIFT           (30U)
#define PLL_DFS_CTRL_0_CLKOUT_EN_WIDTH           (1U)
#define PLL_DFS_CTRL_0_CLKOUT_EN(x)              (((uint32_t)(((uint32_t)(x)) << PLL_DFS_CTRL_0_CLKOUT_EN_SHIFT)) & PLL_DFS_CTRL_0_CLKOUT_EN_MASK)

#define PLL_DFS_CTRL_0_ENABLE_MASK               (0x80000000U)
#define PLL_DFS_CTRL_0_ENABLE_SHIFT              (31U)
#define PLL_DFS_CTRL_0_ENABLE_WIDTH              (1U)
#define PLL_DFS_CTRL_0_ENABLE(x)                 (((uint32_t)(((uint32_t)(x)) << PLL_DFS_CTRL_0_ENABLE_SHIFT)) & PLL_DFS_CTRL_0_ENABLE_MASK)
/*! @} */

/*! @name DFS_DIV_0 - DFS Division */
/*! @{ */

