zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_PLL.h
#define PLL_DFS_DIV_0_MFN_MASK                   (0x7U)
#define PLL_DFS_DIV_0_MFN_SHIFT                  (0U)
#define PLL_DFS_DIV_0_MFN_WIDTH                  (3U)
#define PLL_DFS_DIV_0_MFN(x)                     (((uint32_t)(((uint32_t)(x)) << PLL_DFS_DIV_0_MFN_SHIFT)) & PLL_DFS_DIV_0_MFN_MASK)

#define PLL_DFS_DIV_0_MFI_MASK                   (0xFF00U)
#define PLL_DFS_DIV_0_MFI_SHIFT                  (8U)
#define PLL_DFS_DIV_0_MFI_WIDTH                  (8U)
#define PLL_DFS_DIV_0_MFI(x)                     (((uint32_t)(((uint32_t)(x)) << PLL_DFS_DIV_0_MFI_SHIFT)) & PLL_DFS_DIV_0_MFI_MASK)
/*! @} */

/*! @name DFS_CTRL_1 - DFS Control */
/*! @{ */

#define PLL_DFS_CTRL_1_BYPASS_EN_MASK            (0x800000U)
#define PLL_DFS_CTRL_1_BYPASS_EN_SHIFT           (23U)
#define PLL_DFS_CTRL_1_BYPASS_EN_WIDTH           (1U)
#define PLL_DFS_CTRL_1_BYPASS_EN(x)              (((uint32_t)(((uint32_t)(x)) << PLL_DFS_CTRL_1_BYPASS_EN_SHIFT)) & PLL_DFS_CTRL_1_BYPASS_EN_MASK)

#define PLL_DFS_CTRL_1_CLKOUT_EN_MASK            (0x40000000U)
#define PLL_DFS_CTRL_1_CLKOUT_EN_SHIFT           (30U)
#define PLL_DFS_CTRL_1_CLKOUT_EN_WIDTH           (1U)
#define PLL_DFS_CTRL_1_CLKOUT_EN(x)              (((uint32_t)(((uint32_t)(x)) << PLL_DFS_CTRL_1_CLKOUT_EN_SHIFT)) & PLL_DFS_CTRL_1_CLKOUT_EN_MASK)

#define PLL_DFS_CTRL_1_ENABLE_MASK               (0x80000000U)
#define PLL_DFS_CTRL_1_ENABLE_SHIFT              (31U)
#define PLL_DFS_CTRL_1_ENABLE_WIDTH              (1U)
#define PLL_DFS_CTRL_1_ENABLE(x)                 (((uint32_t)(((uint32_t)(x)) << PLL_DFS_CTRL_1_ENABLE_SHIFT)) & PLL_DFS_CTRL_1_ENABLE_MASK)
/*! @} */

/*! @name DFS_DIV_1 - DFS Division */
/*! @{ */

#define PLL_DFS_DIV_1_MFN_MASK                   (0x7U)
#define PLL_DFS_DIV_1_MFN_SHIFT                  (0U)
#define PLL_DFS_DIV_1_MFN_WIDTH                  (3U)
#define PLL_DFS_DIV_1_MFN(x)                     (((uint32_t)(((uint32_t)(x)) << PLL_DFS_DIV_1_MFN_SHIFT)) & PLL_DFS_DIV_1_MFN_MASK)

#define PLL_DFS_DIV_1_MFI_MASK                   (0xFF00U)
#define PLL_DFS_DIV_1_MFI_SHIFT                  (8U)
#define PLL_DFS_DIV_1_MFI_WIDTH                  (8U)
#define PLL_DFS_DIV_1_MFI(x)                     (((uint32_t)(((uint32_t)(x)) << PLL_DFS_DIV_1_MFI_SHIFT)) & PLL_DFS_DIV_1_MFI_MASK)
/*! @} */

/*! @name DFS_CTRL_2 - DFS Control */
/*! @{ */

#define PLL_DFS_CTRL_2_BYPASS_EN_MASK            (0x800000U)
#define PLL_DFS_CTRL_2_BYPASS_EN_SHIFT           (23U)
#define PLL_DFS_CTRL_2_BYPASS_EN_WIDTH           (1U)
#define PLL_DFS_CTRL_2_BYPASS_EN(x)              (((uint32_t)(((uint32_t)(x)) << PLL_DFS_CTRL_2_BYPASS_EN_SHIFT)) & PLL_DFS_CTRL_2_BYPASS_EN_MASK)

#define PLL_DFS_CTRL_2_CLKOUT_EN_MASK            (0x40000000U)
#define PLL_DFS_CTRL_2_CLKOUT_EN_SHIFT           (30U)
#define PLL_DFS_CTRL_2_CLKOUT_EN_WIDTH           (1U)
#define PLL_DFS_CTRL_2_CLKOUT_EN(x)              (((uint32_t)(((uint32_t)(x)) << PLL_DFS_CTRL_2_CLKOUT_EN_SHIFT)) & PLL_DFS_CTRL_2_CLKOUT_EN_MASK)

#define PLL_DFS_CTRL_2_ENABLE_MASK               (0x80000000U)
#define PLL_DFS_CTRL_2_ENABLE_SHIFT              (31U)
#define PLL_DFS_CTRL_2_ENABLE_WIDTH              (1U)
#define PLL_DFS_CTRL_2_ENABLE(x)                 (((uint32_t)(((uint32_t)(x)) << PLL_DFS_CTRL_2_ENABLE_SHIFT)) & PLL_DFS_CTRL_2_ENABLE_MASK)
/*! @} */

/*! @name DFS_DIV_2 - DFS Division */
/*! @{ */

#define PLL_DFS_DIV_2_MFN_MASK                   (0x7U)
#define PLL_DFS_DIV_2_MFN_SHIFT                  (0U)
#define PLL_DFS_DIV_2_MFN_WIDTH                  (3U)
#define PLL_DFS_DIV_2_MFN(x)                     (((uint32_t)(((uint32_t)(x)) << PLL_DFS_DIV_2_MFN_SHIFT)) & PLL_DFS_DIV_2_MFN_MASK)

#define PLL_DFS_DIV_2_MFI_MASK                   (0xFF00U)
#define PLL_DFS_DIV_2_MFI_SHIFT                  (8U)
#define PLL_DFS_DIV_2_MFI_WIDTH                  (8U)
#define PLL_DFS_DIV_2_MFI(x)                     (((uint32_t)(((uint32_t)(x)) << PLL_DFS_DIV_2_MFI_SHIFT)) & PLL_DFS_DIV_2_MFI_MASK)
/*! @} */

/*! @name DFS_CTRL_3 - DFS Control */
/*! @{ */

#define PLL_DFS_CTRL_3_BYPASS_EN_MASK            (0x800000U)
#define PLL_DFS_CTRL_3_BYPASS_EN_SHIFT           (23U)
#define PLL_DFS_CTRL_3_BYPASS_EN_WIDTH           (1U)
#define PLL_DFS_CTRL_3_BYPASS_EN(x)              (((uint32_t)(((uint32_t)(x)) << PLL_DFS_CTRL_3_BYPASS_EN_SHIFT)) & PLL_DFS_CTRL_3_BYPASS_EN_MASK)

#define PLL_DFS_CTRL_3_CLKOUT_EN_MASK            (0x40000000U)
#define PLL_DFS_CTRL_3_CLKOUT_EN_SHIFT           (30U)
#define PLL_DFS_CTRL_3_CLKOUT_EN_WIDTH           (1U)
#define PLL_DFS_CTRL_3_CLKOUT_EN(x)              (((uint32_t)(((uint32_t)(x)) << PLL_DFS_CTRL_3_CLKOUT_EN_SHIFT)) & PLL_DFS_CTRL_3_CLKOUT_EN_MASK)

#define PLL_DFS_CTRL_3_ENABLE_MASK               (0x80000000U)
#define PLL_DFS_CTRL_3_ENABLE_SHIFT              (31U)
#define PLL_DFS_CTRL_3_ENABLE_WIDTH              (1U)
#define PLL_DFS_CTRL_3_ENABLE(x)                 (((uint32_t)(((uint32_t)(x)) << PLL_DFS_CTRL_3_ENABLE_SHIFT)) & PLL_DFS_CTRL_3_ENABLE_MASK)
/*! @} */

/*! @name DFS_DIV_3 - DFS Division */
/*! @{ */

#define PLL_DFS_DIV_3_MFN_MASK                   (0x7U)
#define PLL_DFS_DIV_3_MFN_SHIFT                  (0U)
#define PLL_DFS_DIV_3_MFN_WIDTH                  (3U)
#define PLL_DFS_DIV_3_MFN(x)                     (((uint32_t)(((uint32_t)(x)) << PLL_DFS_DIV_3_MFN_SHIFT)) & PLL_DFS_DIV_3_MFN_MASK)

#define PLL_DFS_DIV_3_MFI_MASK                   (0xFF00U)
#define PLL_DFS_DIV_3_MFI_SHIFT                  (8U)
#define PLL_DFS_DIV_3_MFI_WIDTH                  (8U)
#define PLL_DFS_DIV_3_MFI(x)                     (((uint32_t)(((uint32_t)(x)) << PLL_DFS_DIV_3_MFI_SHIFT)) & PLL_DFS_DIV_3_MFI_MASK)
/*! @} */

/*! @name PLL_OUTPUT_DIVIDER_0 - PLL Output Divider */
/*! @{ */

#define PLL_PLL_OUTPUT_DIVIDER_0_OUTPUT_DIV_MASK (0xFF0000U)
#define PLL_PLL_OUTPUT_DIVIDER_0_OUTPUT_DIV_SHIFT (16U)
#define PLL_PLL_OUTPUT_DIVIDER_0_OUTPUT_DIV_WIDTH (8U)
#define PLL_PLL_OUTPUT_DIVIDER_0_OUTPUT_DIV(x)   (((uint32_t)(((uint32_t)(x)) << PLL_PLL_OUTPUT_DIVIDER_0_OUTPUT_DIV_SHIFT)) & PLL_PLL_OUTPUT_DIVIDER_0_OUTPUT_DIV_MASK)

#define PLL_PLL_OUTPUT_DIVIDER_0_DE_MASK         (0x80000000U)
#define PLL_PLL_OUTPUT_DIVIDER_0_DE_SHIFT        (31U)
#define PLL_PLL_OUTPUT_DIVIDER_0_DE_WIDTH        (1U)
#define PLL_PLL_OUTPUT_DIVIDER_0_DE(x)           (((uint32_t)(((uint32_t)(x)) << PLL_PLL_OUTPUT_DIVIDER_0_DE_SHIFT)) & PLL_PLL_OUTPUT_DIVIDER_0_DE_MASK)
/*! @} */

/*! @name PLL_CLK_ODIV - PLL Clock Output Divider */
/*! @{ */

#define PLL_PLL_CLK_ODIV_ODIV_MASK               (0xFFU)
#define PLL_PLL_CLK_ODIV_ODIV_SHIFT              (0U)
#define PLL_PLL_CLK_ODIV_ODIV_WIDTH              (8U)
#define PLL_PLL_CLK_ODIV_ODIV(x)                 (((uint32_t)(((uint32_t)(x)) << PLL_PLL_CLK_ODIV_ODIV_SHIFT)) & PLL_PLL_CLK_ODIV_ODIV_MASK)
/*! @} */

